import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import { NgModule } from '@angular/core';
import { RouterModule } from '@angular/router';
@Component({
  selector: 'app-home',
  standalone: true,
  imports: [CommonModule,RouterModule],
  templateUrl: './home.component.html',
  styleUrl: './home.component.css'
})
export class HomeComponent {
  blogPosts = [
    {
      title: 'অভিভাবকদের প্রতি',
      author: 'Asif Adnan',
      content: 'প্রিয় অভিভাবক, সন্তানের মুখের দিকে তাকিয়ে হাসিমুখে জীবনের সব কষ্ট সয়ে নেন পিতা-মাতা। সন্তানের জন্য ফিরিয়ে দেন নিজের শত শখ-আহ্লাদ। কিন্তু সুন্দর ভবিষ্যতের জন্য আপনি দিনের পর দিন যেটে যাচ্ছেন তা-দেব জীবনের যে বিভিন্ন দিক সামাল দিতে করা হয়েছে সুরক্ষিতভবতা - তা কি আপনি জানেন? অধিকাংশই ভুল ধারণা নিয়ে চলেন...',
      date: '৯ জানুয়ারী, ২০২৪',
      readTime: '10 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    {
      title: 'বিকৃতির সমষ্টি',
      author: 'Asif Adnan',
      content: '[লেখাটি নেয়া হয়েছে এলজিবিটি আন্দোলন নিয়ে প্রবন্ধিকা (ইবনে মা আসাদ)] এই \'অশ্লীল ফালান\' থেকে ট্রান্সজেন্ডার সর্বত্র মোটামুটি নতুন। আজকাল ছোটোদের ট্রান্সজেন্ডার বলা হচ্ছে। ট্রান্সজেন্ডার হল ট্রান্স-জেন্ডার...',
      date: '৮ জানুয়ারী, ২০২৪',
      readTime: '8 MIN READ'
    },
    // Add more posts here
  ];
}
